#+TITLE: Essential EcmaScript 2017
#+AUTHOR: [[https://oyanglul.us][欧阳继超]]
#+EMAIL: oyanglulu@gmail.com
#+PROPERTY: header-args :results output :exports both
#+OPTIONS: num:3
#+OPTIONS: num:nil

* Object.values

#+BEGIN_SRC js :results output
var obj = { foo: "bar", baz: 42 };
var array = [1,2,3]
var symbol = Symbol('abc')
var fn = function(){ return {foo: 'bar'} }
fn.baz = 42;
var string = 'foobar'
var number = 123
console.log(Object.values(obj));
console.log(Object.values(array));
console.log(Object.values(symbol));
console.log(Object.values(string));
console.log(Object.values(number));
console.log(Object.values(fn));
console.log(Object.values(true));
#+END_SRC

#+RESULTS:
: [ 'bar', 42 ]
: [ 1, 2, 3 ]
: []
: [ 'f', 'o', 'o', 'b', 'a', 'r' ]
: []
: [ 42 ]
: []

* Object.entries
#+BEGIN_SRC js :results output
var obj = { foo: "bar", baz: 42 };
var array = [1,2,3]
var symbol = Symbol('abc')
var fn = function(){ return {foo: 'bar'} }
fn.baz = 42;
var string = 'foobar'
var number = 123
console.log(Object.entries(obj));
console.log(Object.entries(array));
console.log(Object.entries(symbol));
console.log(Object.entries(string));
console.log(Object.entries(number));
console.log(Object.entries(fn));
console.log(Object.entries(true));
#+END_SRC

#+RESULTS:
#+begin_example
[ [ 'foo', 'bar' ], [ 'baz', 42 ] ]
[ [ '0', 1 ], [ '1', 2 ], [ '2', 3 ] ]
[]
[ [ '0', 'f' ],
  [ '1', 'o' ],
  [ '2', 'o' ],
  [ '3', 'b' ],
  [ '4', 'a' ],
  [ '5', 'r' ] ]
[]
[ [ 'baz', 42 ] ]
[]
#+end_example

** Promise
#+BEGIN_SRC js
new Promise((resolve, reject) => {
    console.log('first')
    setTimeout(resolve, 1000);
}).then(() => {
    console.log('next 1s')
    throw new Error("hmm");
}).catch(err => {
    console.log('error:'+err)
})
#+END_SRC

#+RESULTS:
: first
: next 1s
: error:Error: hmm

** generator
现代浏览器都已经支持 generator 了, 写一个fibonacci数列生成器
#+BEGIN_SRC js
  function* fibonacci() {
      var pre = 0, cur = 1;
      for (;;) {
          var temp = pre;
          pre = cur;
          cur += temp;
          yield cur;
      }
  }
let fib = fibonacci()
console.log(fib.next())
console.log(fib.next())
console.log(fib.next())
console.log(fib.next())
console.log(fib.next())
#+END_SRC

#+RESULTS:
: { value: 1, done: false }
: { value: 2, done: false }
: { value: 3, done: false }
: { value: 5, done: false }
: { value: 8, done: false }
